In [139]:
import pandas as pd

In [140]:
df = pd.read_csv('sales_data.csv')

In [141]:
df.head()

         Date     Category  Value   Product  Sales Region
0  2024-06-12  Electronics  202.0  Product5    253  South
1  2024-01-29    Furniture    NaN  Product4    329   East
2  2024-01-07  Electronics  960.0  Product3    140   East
3  2024-03-11      Grocery    NaN  Product2    494  North
4  2024-03-03      Grocery  206.0  Product2    316  North

In [142]:
df.tail()

          Date   Category  Value   Product  Sales Region
45  2024-03-29    Grocery    NaN  Product5    171   West
46  2024-06-03   Clothing  786.0  Product5    211  South
47  2024-03-08        NaN  662.0  Product1    455   West
48  2024-01-12    Grocery  975.0  Product5    493  South
49  2024-04-27  Furniture  666.0  Product3    279  South

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  42 non-null     object
 2   Value     40 non-null     float64
 3   Product   50 non-null     object
 4   Sales     50 non-null     int64
 5   Region    50 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 2.5+ KB

In [144]:
df.describe()

            Value       Sales
count   40.000000   50.000000
mean   562.000000  266.820000
std    264.655461  147.266479
min    120.000000   11.000000
25%    342.500000  141.000000
50%    562.500000  276.500000
75%    789.250000  396.500000
max    975.000000  494.000000

In [145]:
df.shape

(50, 6)

In [146]:
df.columns

Index(['Date', 'Category', 'Value', 'Product', 'Sales', 'Region'], dtype='object')

In [147]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales         int64
Region       object
dtype: object

In [148]:
# creating the copy of dataframe...
df1 = df.copy()

In [149]:
# Checking for duplicates.
df1[df1.duplicated()].sum()

Date          0
Category      0
Value       0.0
Product       0
Sales         0
Region        0
dtype: object

In [150]:
# Handling Missing values.
(df1.isnull().sum() / len(df1)) * 100

Date         0.0
Category    16.0
Value       20.0
Product      0.0
Sales        0.0
Region       0.0
dtype: float64

In [151]:
# Filling the missing values.
df1['Category'] = df1['Category'].fillna(df1['Category'].mode()[0])
df1['Value'] = df1['Value'].fillna(df1['Value'].mean())

In [152]:
df1.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [153]:
# renaming a column
df1=df1.rename(columns = {'Date' : 'Sale_date'})

In [154]:
df1.head()

    Sale_date     Category  Value   Product  Sales Region
0  2024-06-12  Electronics  202.0  Product5    253  South
1  2024-01-29    Furniture  562.0  Product4    329   East
2  2024-01-07  Electronics  960.0  Product3    140   East
3  2024-03-11      Grocery  562.0  Product2    494  North
4  2024-03-03      Grocery  206.0  Product2    316  North

In [155]:
df1['Value'] = df1['Value'].astype('Int64')

In [156]:
df1.head()

    Sale_date     Category  Value   Product  Sales Region
0  2024-06-12  Electronics    202  Product5    253  South
1  2024-01-29    Furniture    562  Product4    329   East
2  2024-01-07  Electronics    960  Product3    140   East
3  2024-03-11      Grocery    562  Product2    494  North
4  2024-03-03      Grocery    206  Product2    316  North

In [157]:
df1['Value'] = df1['Value'].apply(lambda x:x*2)

In [158]:
df1.head()

    Sale_date     Category  Value   Product  Sales Region
0  2024-06-12  Electronics    404  Product5    253  South
1  2024-01-29    Furniture   1124  Product4    329   East
2  2024-01-07  Electronics   1920  Product3    140   East
3  2024-03-11      Grocery   1124  Product2    494  North
4  2024-03-03      Grocery    412  Product2    316  North

In [159]:
# Aggregation and Groupby

In [160]:
group_mean = df.groupby('Product')['Value'].mean()

In [161]:
group_mean

Product
Product1    477.400000
Product2    512.500000
Product3    699.285714
Product4    528.166667
Product5    597.000000
Name: Value, dtype: float64

In [162]:
group_sum = df.groupby(['Product','Region'])['Value'].sum()

In [163]:
group_sum

Product   Region
Product1  East      1595.0
          North      869.0
          South      630.0
          West      1680.0
Product2  East      1421.0
          North      206.0
          South      566.0
          West       882.0
Product3  East      1764.0
          North      761.0
          South     1465.0
          West       905.0
Product4  East       800.0
          North      575.0
          West      1794.0
Product5  East       962.0
          North      158.0
          South     3933.0
          West      1514.0
Name: Value, dtype: float64

In [164]:
# aggregate multiple functions.

agg_df1 = df.groupby('Region')['Value'].agg(['mean','sum','count'])
agg_df1

              mean     sum  count
Region
East    545.166667  6542.0     12
North   428.166667  2569.0      6
South   599.454545  6594.0     11
West    615.909091  6775.0     11

In [165]:
# ## Merging and Joining DataFrames

# Merging and joining DataFrames are essential for combining datasets. You can use the `pd.merge()` 
# function to merge two DataFrames on a specific key column. Different types of joins are available: inner, 
# outer, left, and right joins.

In [166]:
df_1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6]})

In [167]:
df_1

  key  value1
0   A       1
1   B       2
2   C       3

In [168]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [169]:
merged_inner = pd.merge(df_1, df2, on='key', how='inner')
merged_inner

  key  value1  value2
0   A       1       4
1   B       2       5

In [170]:
merged_outer = pd.merge(df_1, df2, on='key', how='outer')
merged_outer

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [171]:
merged_left = pd.merge(df_1, df2, on='key', how='left')
merged_left

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [172]:
merged_right = pd.merge(df_1, df2, on='key', how='right')
merged_right

  key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6